leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxPort_regdef.h
/** \brief  Identification Register */
typedef struct _Ifx_P_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_P_ID_Bits;

/** \brief  Port Input Register */
typedef struct _Ifx_P_IN_Bits
{
    unsigned int P0:1;                      /**< \brief [0:0] Port n Input Bit 0 (rh) */
    unsigned int P1:1;                      /**< \brief [1:1] Port n Input Bit 1 (rh) */
    unsigned int P2:1;                      /**< \brief [2:2] Port n Input Bit 2 (rh) */
    unsigned int P3:1;                      /**< \brief [3:3] Port n Input Bit 3 (rh) */
    unsigned int P4:1;                      /**< \brief [4:4] Port n Input Bit 4 (rh) */
    unsigned int P5:1;                      /**< \brief [5:5] Port n Input Bit 5 (rh) */
    unsigned int P6:1;                      /**< \brief [6:6] Port n Input Bit 6 (rh) */
    unsigned int P7:1;                      /**< \brief [7:7] Port n Input Bit 7 (rh) */
    unsigned int P8:1;                      /**< \brief [8:8] Port n Input Bit 8 (rh) */
    unsigned int P9:1;                      /**< \brief [9:9] Port n Input Bit 9 (rh) */
    unsigned int P10:1;                     /**< \brief [10:10] Port n Input Bit 10 (rh) */
    unsigned int P11:1;                     /**< \brief [11:11] Port n Input Bit 11 (rh) */
    unsigned int P12:1;                     /**< \brief [12:12] Port n Input Bit 12 (rh) */
    unsigned int P13:1;                     /**< \brief [13:13] Port n Input Bit 13 (rh) */
    unsigned int P14:1;                     /**< \brief [14:14] Port n Input Bit 14 (rh) */
    unsigned int P15:1;                     /**< \brief [15:15] Port n Input Bit 15 (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_IN_Bits;

/** \brief  Port Input/Output Control Register 0 */
typedef struct _Ifx_P_IOCR0_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int PC0:5;                     /**< \brief [7:3]  (rw) */
    unsigned int reserved_8:3;              /**< \brief \internal Reserved */
    unsigned int PC1:5;                     /**< \brief [15:11]  (rw) */
    unsigned int reserved_16:3;             /**< \brief \internal Reserved */
    unsigned int PC2:5;                     /**< \brief [23:19]  (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int PC3:5;                     /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR0_Bits;

/** \brief  Port Input/Output Control Register 12 */
typedef struct _Ifx_P_IOCR12_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int PC12:5;                    /**< \brief [7:3]  (rw) */
    unsigned int reserved_8:3;              /**< \brief \internal Reserved */
    unsigned int PC13:5;                    /**< \brief [15:11]  (rw) */
    unsigned int reserved_16:3;             /**< \brief \internal Reserved */
    unsigned int PC14:5;                    /**< \brief [23:19]  (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int PC15:5;                    /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR12_Bits;

/** \brief  Port Input/Output Control Register 4 */
typedef struct _Ifx_P_IOCR4_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int PC4:5;                     /**< \brief [7:3]  (rw) */
    unsigned int reserved_8:3;              /**< \brief \internal Reserved */
    unsigned int PC5:5;                     /**< \brief [15:11]  (rw) */
    unsigned int reserved_16:3;             /**< \brief \internal Reserved */
    unsigned int PC6:5;                     /**< \brief [23:19]  (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int PC7:5;                     /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR4_Bits;

/** \brief  Port Input/Output Control Register 8 */
typedef struct _Ifx_P_IOCR8_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int PC8:5;                     /**< \brief [7:3]  (rw) */
    unsigned int reserved_8:3;              /**< \brief \internal Reserved */
    unsigned int PC9:5;                     /**< \brief [15:11]  (rw) */
    unsigned int reserved_16:3;             /**< \brief \internal Reserved */
    unsigned int PC10:5;                    /**< \brief [23:19]  (rw) */
    unsigned int reserved_24:3;             /**< \brief \internal Reserved */
    unsigned int PC11:5;                    /**< \brief [31:27]  (rw) */
} Ifx_P_IOCR8_Bits;

/** \brief  Port Output Modification Clear Register 0 */
typedef struct _Ifx_P_OMCR0_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int PCL0:1;                    /**< \brief [16:16] Port n Clear Bit 0 (w) */
    unsigned int PCL1:1;                    /**< \brief [17:17] Port n Clear Bit 1 (w) */
    unsigned int PCL2:1;                    /**< \brief [18:18] Port n Clear Bit 2 (w) */
    unsigned int PCL3:1;                    /**< \brief [19:19] Port n Clear Bit 3 (w) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_P_OMCR0_Bits;

/** \brief  Port Output Modification Clear Register 12 */
typedef struct _Ifx_P_OMCR12_Bits
{
    unsigned int reserved_0:28;             /**< \brief \internal Reserved */
    unsigned int PCL12:1;                   /**< \brief [28:28] Port n Clear Bit 12 (w) */
    unsigned int PCL13:1;                   /**< \brief [29:29] Port n Clear Bit 13 (w) */
    unsigned int PCL14:1;                   /**< \brief [30:30] Port n Clear Bit 14 (w) */
    unsigned int PCL15:1;                   /**< \brief [31:31] Port n Clear Bit 15 (w) */
} Ifx_P_OMCR12_Bits;

/** \brief  Port Output Modification Clear Register 4 */
typedef struct _Ifx_P_OMCR4_Bits
{
    unsigned int reserved_0:20;             /**< \brief \internal Reserved */
    unsigned int PCL4:1;                    /**< \brief [20:20] Port n Clear Bit 4 (w) */
    unsigned int PCL5:1;                    /**< \brief [21:21] Port n Clear Bit 5 (w) */
    unsigned int PCL6:1;                    /**< \brief [22:22] Port n Clear Bit 6 (w) */
    unsigned int PCL7:1;                    /**< \brief [23:23] Port n Clear Bit 7 (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_P_OMCR4_Bits;

/** \brief  Port Output Modification Clear Register 8 */
typedef struct _Ifx_P_OMCR8_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int PCL8:1;                    /**< \brief [24:24] Port n Clear Bit 8 (w) */
    unsigned int PCL9:1;                    /**< \brief [25:25] Port n Clear Bit 9 (w) */
    unsigned int PCL10:1;                   /**< \brief [26:26] Port n Clear Bit 10 (w) */
    unsigned int PCL11:1;                   /**< \brief [27:27] Port n Clear Bit 11 (w) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_P_OMCR8_Bits;

/** \brief  Port Output Modification Clear Register */
typedef struct _Ifx_P_OMCR_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int PCL0:1;                    /**< \brief [16:16] Port n Clear Bit 0 (w) */
    unsigned int PCL1:1;                    /**< \brief [17:17] Port n Clear Bit 1 (w) */
    unsigned int PCL2:1;                    /**< \brief [18:18] Port n Clear Bit 2 (w) */
    unsigned int PCL3:1;                    /**< \brief [19:19] Port n Clear Bit 3 (w) */
    unsigned int PCL4:1;                    /**< \brief [20:20] Port n Clear Bit 4 (w) */
    unsigned int PCL5:1;                    /**< \brief [21:21] Port n Clear Bit 5 (w) */
    unsigned int PCL6:1;                    /**< \brief [22:22] Port n Clear Bit 6 (w) */
    unsigned int PCL7:1;                    /**< \brief [23:23] Port n Clear Bit 7 (w) */
    unsigned int PCL8:1;                    /**< \brief [24:24] Port n Clear Bit 8 (w) */
    unsigned int PCL9:1;                    /**< \brief [25:25] Port n Clear Bit 9 (w) */
    unsigned int PCL10:1;                   /**< \brief [26:26] Port n Clear Bit 10 (w) */
    unsigned int PCL11:1;                   /**< \brief [27:27] Port n Clear Bit 11 (w) */
    unsigned int PCL12:1;                   /**< \brief [28:28] Port n Clear Bit 12 (w) */
    unsigned int PCL13:1;                   /**< \brief [29:29] Port n Clear Bit 13 (w) */
    unsigned int PCL14:1;                   /**< \brief [30:30] Port n Clear Bit 14 (w) */
    unsigned int PCL15:1;                   /**< \brief [31:31] Port n Clear Bit 15 (w) */
} Ifx_P_OMCR_Bits;

/** \brief  Port Output Modification Register */
typedef struct _Ifx_P_OMR_Bits
{
    unsigned int PS0:1;                     /**< \brief [0:0]  (w) */
    unsigned int PS1:1;                     /**< \brief [1:1]  (w) */
    unsigned int PS2:1;                     /**< \brief [2:2]  (w) */
    unsigned int PS3:1;                     /**< \brief [3:3]  (w) */
    unsigned int PS4:1;                     /**< \brief [4:4]  (w) */
    unsigned int PS5:1;                     /**< \brief [5:5]  (w) */
    unsigned int PS6:1;                     /**< \brief [6:6]  (w) */
    unsigned int PS7:1;                     /**< \brief [7:7]  (w) */
    unsigned int PS8:1;                     /**< \brief [8:8]  (w) */
    unsigned int PS9:1;                     /**< \brief [9:9]  (w) */
    unsigned int PS10:1;                    /**< \brief [10:10]  (w) */
    unsigned int PS11:1;                    /**< \brief [11:11]  (w) */
    unsigned int PS12:1;                    /**< \brief [12:12]  (w) */
    unsigned int PS13:1;                    /**< \brief [13:13]  (w) */
    unsigned int PS14:1;                    /**< \brief [14:14]  (w) */
    unsigned int PS15:1;                    /**< \brief [15:15]  (w) */
    unsigned int PCL0:1;                    /**< \brief [16:16]  (w) */
    unsigned int PCL1:1;                    /**< \brief [17:17]  (w) */
    unsigned int PCL2:1;                    /**< \brief [18:18]  (w) */
    unsigned int PCL3:1;                    /**< \brief [19:19]  (w) */
    unsigned int PCL4:1;                    /**< \brief [20:20]  (w) */
    unsigned int PCL5:1;                    /**< \brief [21:21]  (w) */
    unsigned int PCL6:1;                    /**< \brief [22:22]  (w) */
    unsigned int PCL7:1;                    /**< \brief [23:23]  (w) */
    unsigned int PCL8:1;                    /**< \brief [24:24]  (w) */
    unsigned int PCL9:1;                    /**< \brief [25:25]  (w) */
    unsigned int PCL10:1;                   /**< \brief [26:26]  (w) */
    unsigned int PCL11:1;                   /**< \brief [27:27]  (w) */
    unsigned int PCL12:1;                   /**< \brief [28:28]  (w) */
    unsigned int PCL13:1;                   /**< \brief [29:29]  (w) */
    unsigned int PCL14:1;                   /**< \brief [30:30]  (w) */
    unsigned int PCL15:1;                   /**< \brief [31:31]  (w) */
} Ifx_P_OMR_Bits;

/** \brief  Port Output Modification Set Register 0 */
typedef struct _Ifx_P_OMSR0_Bits
{
    unsigned int PS0:1;                     /**< \brief [0:0] Port n Set Bit 0 (w) */
    unsigned int PS1:1;                     /**< \brief [1:1] Port n Set Bit 1 (w) */
    unsigned int PS2:1;                     /**< \brief [2:2] Port n Set Bit 2 (w) */
    unsigned int PS3:1;                     /**< \brief [3:3] Port n Set Bit 3 (w) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_P_OMSR0_Bits;

/** \brief  Port Output Modification Set Register 12 */
typedef struct _Ifx_P_OMSR12_Bits
{
    unsigned int reserved_0:12;             /**< \brief \internal Reserved */
    unsigned int PS12:1;                    /**< \brief [12:12] Port n Set Bit 12 (w) */
    unsigned int PS13:1;                    /**< \brief [13:13] Port n Set Bit 13 (w) */
    unsigned int PS14:1;                    /**< \brief [14:14] Port n Set Bit 14 (w) */
    unsigned int PS15:1;                    /**< \brief [15:15] Port n Set Bit 15 (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_OMSR12_Bits;

/** \brief  Port Output Modification Set Register 4 */
typedef struct _Ifx_P_OMSR4_Bits
{
    unsigned int reserved_0:4;              /**< \brief \internal Reserved */
    unsigned int PS4:1;                     /**< \brief [4:4] Port n Set Bit 4 (w) */
    unsigned int PS5:1;                     /**< \brief [5:5] Port n Set Bit 5 (w) */
    unsigned int PS6:1;                     /**< \brief [6:6] Port n Set Bit 6 (w) */
    unsigned int PS7:1;                     /**< \brief [7:7] Port n Set Bit 7 (w) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_P_OMSR4_Bits;

/** \brief  Port Output Modification Set Register 8 */
typedef struct _Ifx_P_OMSR8_Bits
{
    unsigned int reserved_0:8;              /**< \brief \internal Reserved */
    unsigned int PS8:1;                     /**< \brief [8:8] Port n Set Bit 8 (w) */
    unsigned int PS9:1;                     /**< \brief [9:9] Port n Set Bit 9 (w) */
    unsigned int PS10:1;                    /**< \brief [10:10] Port n Set Bit 10 (w) */
    unsigned int PS11:1;                    /**< \brief [11:11] Port n Set Bit 11 (w) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_P_OMSR8_Bits;

/** \brief  Port Output Modification Set Register */
typedef struct _Ifx_P_OMSR_Bits
{
    unsigned int PS0:1;                     /**< \brief [0:0] Port n Set Bit 0 (w) */
    unsigned int PS1:1;                     /**< \brief [1:1] Port n Set Bit 1 (w) */
    unsigned int PS2:1;                     /**< \brief [2:2] Port n Set Bit 2 (w) */
    unsigned int PS3:1;                     /**< \brief [3:3] Port n Set Bit 3 (w) */
    unsigned int PS4:1;                     /**< \brief [4:4] Port n Set Bit 4 (w) */
    unsigned int PS5:1;                     /**< \brief [5:5] Port n Set Bit 5 (w) */
    unsigned int PS6:1;                     /**< \brief [6:6] Port n Set Bit 6 (w) */
    unsigned int PS7:1;                     /**< \brief [7:7] Port n Set Bit 7 (w) */
    unsigned int PS8:1;                     /**< \brief [8:8] Port n Set Bit 8 (w) */
    unsigned int PS9:1;                     /**< \brief [9:9] Port n Set Bit 9 (w) */
    unsigned int PS10:1;                    /**< \brief [10:10] Port n Set Bit 10 (w) */
    unsigned int PS11:1;                    /**< \brief [11:11] Port n Set Bit 11 (w) */
    unsigned int PS12:1;                    /**< \brief [12:12] Port n Set Bit 12 (w) */
    unsigned int PS13:1;                    /**< \brief [13:13] Port n Set Bit 13 (w) */
    unsigned int PS14:1;                    /**< \brief [14:14] Port n Set Bit 14 (w) */
    unsigned int PS15:1;                    /**< \brief [15:15] Port n Set Bit 15 (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_OMSR_Bits;

/** \brief  Port Output Register */
typedef struct _Ifx_P_OUT_Bits
{
    unsigned int P0:1;                      /**< \brief [0:0]  (rwh) */
    unsigned int P1:1;                      /**< \brief [1:1]  (rwh) */
    unsigned int P2:1;                      /**< \brief [2:2]  (rwh) */
    unsigned int P3:1;                      /**< \brief [3:3]  (rwh) */
    unsigned int P4:1;                      /**< \brief [4:4]  (rwh) */
    unsigned int P5:1;                      /**< \brief [5:5]  (rwh) */
    unsigned int P6:1;                      /**< \brief [6:6]  (rwh) */
    unsigned int P7:1;                      /**< \brief [7:7]  (rwh) */
    unsigned int P8:1;                      /**< \brief [8:8]  (rwh) */
    unsigned int P9:1;                      /**< \brief [9:9]  (rwh) */
    unsigned int P10:1;                     /**< \brief [10:10]  (rwh) */
    unsigned int P11:1;                     /**< \brief [11:11]  (rwh) */
    unsigned int P12:1;                     /**< \brief [12:12]  (rwh) */
    unsigned int P13:1;                     /**< \brief [13:13]  (rwh) */
    unsigned int P14:1;                     /**< \brief [14:14]  (rwh) */
    unsigned int P15:1;                     /**< \brief [15:15]  (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_OUT_Bits;

