leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxPort_regdef.h
/** \brief  Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_ID_Bits B;                        /**< \brief Bitfield access */
} Ifx_P_ID;

/** \brief  Port Input Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_IN_Bits B;                        /**< \brief Bitfield access */
} Ifx_P_IN;

/** \brief  Port Input/Output Control Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_IOCR0_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_IOCR0;

/** \brief  Port Input/Output Control Register 12 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_IOCR12_Bits B;                    /**< \brief Bitfield access */
} Ifx_P_IOCR12;

/** \brief  Port Input/Output Control Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_IOCR4_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_IOCR4;

/** \brief  Port Input/Output Control Register 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_IOCR8_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_IOCR8;

/** \brief  Port Output Modification Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMCR_Bits B;                      /**< \brief Bitfield access */
} Ifx_P_OMCR;

/** \brief  Port Output Modification Clear Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMCR0_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_OMCR0;

/** \brief  Port Output Modification Clear Register 12 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMCR12_Bits B;                    /**< \brief Bitfield access */
} Ifx_P_OMCR12;

/** \brief  Port Output Modification Clear Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMCR4_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_OMCR4;

/** \brief  Port Output Modification Clear Register 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMCR8_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_OMCR8;

/** \brief  Port Output Modification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMR_Bits B;                       /**< \brief Bitfield access */
} Ifx_P_OMR;

/** \brief  Port Output Modification Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMSR_Bits B;                      /**< \brief Bitfield access */
} Ifx_P_OMSR;

/** \brief  Port Output Modification Set Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMSR0_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_OMSR0;

/** \brief  Port Output Modification Set Register 12 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMSR12_Bits B;                    /**< \brief Bitfield access */
} Ifx_P_OMSR12;

/** \brief  Port Output Modification Set Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMSR4_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_OMSR4;

/** \brief  Port Output Modification Set Register 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OMSR8_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_OMSR8;

/** \brief  Port Output Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_OUT_Bits B;                       /**< \brief Bitfield access */
} Ifx_P_OUT;

/** \brief  Port Pin Controller Select Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_PCSR_Bits B;                      /**< \brief Bitfield access */
} Ifx_P_PCSR;

/** \brief  Port Pin Function Decision Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_PDISC_Bits B;                     /**< \brief Bitfield access */
} Ifx_P_PDISC;

